from typing import Optional, List

from presidio_analyzer import Pattern, PatternRecognizer


class KRAddressRecognizer(PatternRecognizer):

    PATTERNS = [
        Pattern(
            "서울",
            r"(서울특별시|서울시|서울)+ (중랑구|구로구|동작구|관악구|중구|송파구|종로구|성북구|강서구|양천구|마포구|광진구|강동구|강남구|동대문구|강북구|서대문구|노원구|서초구|성동구|용산구|금천구|은평구|영등포구|도봉구)",
            0.1,
        ),
        Pattern(
            "부산",
            r"(부산광역시|부산시|부산)+ (영도구|강서구|연제구|금정구|부산진구|사하구|수영구|사상구|기장군|동구|남구|중구|해운대구|서구|동래구|북구)",
            0.1,
        ),
        Pattern(
            "대구",
            r"(대구광역시|대구시|대구)+ (달서구|남구|달성군|동구|수성구|북구|중구|서구)",
            0.1,
        ),
        Pattern(
            "인천",
            r"(인천광역시|인천시|인천)+ (옹진군|강화군|계양구|미추홀구|동구|부평구|중구|서구|남동구|연수구)",
            0.1,
        ),
        Pattern(
            "광주",
            r"(광주광역시|광주시|광주)+ (남구|동구|북구|서구|광산구)",
            0.1,
        ),
        Pattern(
            "대전",
            r"(대전광역시|대전시|대전)+ (유성구|대덕구|동구|중구|서구)",
            0.1,
        ),
        Pattern(
            "울산",
            r"(울산광역시|울산시|울산)+ (남구|동구|울주군|중구|북구)",
            0.1,
        ),
        Pattern(
            "세종",
            r"(세종특별자치시|세종시|세종)+ (아름동|전동면|어진동|합강동|장군면|전의면|보람동|종촌동|연기면|금남면|연서면|소정면|고운동|누리동|연동면|조치원읍|세종동|용호동|다솜동|집현동|새롬동|부강면|반곡동|해밀동|소담동|가람동|도담동|한별동|나성동|다정동|대평동|한솔동|산울동)",
            0.1,
        ),
        Pattern(
            "경기도",
            r"(경기도)+ (연천군|안양시 만안구|수원시 권선구|수원시 장안구|시흥시|의왕시|양주시|성남시 수정구|안성시|이천시|용인시 기흥구|안산시 상록구|광주시|가평군|군포시|용인시 처인구|수원시 팔달구|성남시 중원구|고양시 덕양구|고양시 일산서구|화성시|수원시 영통구|파주시|안양시 동안구|여주시|의정부시|용인시 수지구|포천시|부천시|광명시|구리시|하남시|과천시|양평군|성남시 분당구|안산시 단원구|오산시|고양시 일산동구|남양주시|평택시|김포시|동두천시)",
            0.1,
        ),
        Pattern(
            "강원도",
            r"(강원도)+ (동해시|정선군|양양군|속초시|홍천군|횡성군|영월군|인제군|고성군|화천군|춘천시|삼척시|원주시|철원군|태백시|양구군|강릉시|평창군)",
            0.1,
        ),
        Pattern(
            "충청북도",
            r"(충청북도|충북)+ (청주시 흥덕구|단양군|진천군|음성군|청주시 서원구|청주시 청원구|옥천군|영동군|충주시|제천시|보은군|증평군|청주시 상당구|괴산군)",
            0.1,
        ),
        Pattern(
            "충청남도",
            r"(충청남도|충남)+ (예산군|천안시 서북구|서천군|홍성군|공주시|계룡시|논산시|금산군|부여군|태안군|서산시|천안시 동남구|보령시|당진시|아산시|청양군)",
            0.1,
        ),
        Pattern(
            "전라북도",
            r"(전라북도|전북)+ (전주시 덕진구|익산시|순창군|고창군|전주시 완산구|완주군|군산시|무주군|남원시|부안군|임실군|장수군|정읍시|진안군|김제시)",
            0.1,
        ),
        Pattern(
            "전라남도",
            r"(전라남도|전남)+ (목포시|여수시|순천시|함평군|장성군|무안군|진도군|강진군|보성군|완도군|나주시|고흥군|곡성군|구례군|해남군|신안군|영암군|광양시|담양군|화순군|영광군|장흥군)",
            0.1,
        ),
        Pattern(
            "경상북도",
            r"(경상북도|경북)+ (청송군|경주시|고령군|칠곡군|예천군|영천시|상주시|봉화군|구미시|영양군|경산시|울릉군|울진군|안동시|청도군|군위군|영주시|문경시|김천시|의성군|영덕군|포항시 남구|포항시 북구|성주군)",
            0.1,
        ),
        Pattern(
            "경상남도",
            r"(경상남도|경남)+ (의령군|남해군|창원시 진해구|창원시 의창구|창원시 마산합포구|김해시|진주시|밀양시|산청군|창원시 성산구|창녕군|함양군|하동군|산시|거창군|고성군|창원시 마산회원구|합천군|함안군|통영시|거제시|사천시)",
            0.1,
        ),
        Pattern(
            "제주특별자치도",
            r"(제주특별자치도)+ (제주시|서귀포시)",
            0.1,
        ),
    ]
    CONTEXT = [
        "Address",
        "주소",
    ]

    def __init__(
        self,
        patterns: Optional[List[Pattern]] = None,
        context: Optional[List[str]] = None,
        supported_language: str = "ko",
        supported_entity: str = "주소",
    ):
        patterns = patterns if patterns else self.PATTERNS
        context = context if context else self.CONTEXT
        super().__init__(
            supported_entity=supported_entity,
            patterns=patterns,
            context=context,
            supported_language=supported_language,
        )
